// src/data/products.js
export const products = [
  {
    id: 1,
    // 基本信息
    title: "海尔16英寸商务笔记本电脑超轻薄本便携出差旅游办公超级游戏本男女学生上网本窄框大屏手提电脑笔记本 12G【免费升16G】+512G【16英寸大屏】",
    subtitle: "",
    services: ['7天无理由退货', '假一赔十', '急速发货'],
    // 库存信息
    stock: 100,//库存
    sales: 2345,//销量
    //加入购物车
    quantity: 1,     // 数量，加入购物车一次添加的数量
    selected: false,//购物车初始是否选中

    // 物流信息
    delivery: {
      area: "北京市",  // 发货地
      time: "1-3天",  // 预计送达
      free: true       // 是否包邮
    },

    // 促销标签
    promotions: [
      "满1980减200",
      "最高返134京豆"
    ],

    // 图片
    imgsrc: "/x1 (1).jpg",
    images: [
      "/x1 (1).jpg",
      "/x1 (2).jpg",
      "/x1 (3).jpg",
      "/x1 (4).jpg",
      "/x1 (5).jpg"
    ],

    // 规格参数，available可用的
    specifications: [
      {
        name: "颜色",
        key:2,
        options: [
          { value: "12G【免费升16G】+256G【16英寸大屏】", price: 2499 },
          { value: "12G【免费升16G】+512G【16英寸大屏】", price: 2699 },
          { value: "12G【免费升16G】+1TB【16英寸大屏】", price: 3199 }
        ]
      },
      {
        name: "服务",
        key:1,
        options: [
          { value: "破损包退换·7天价保·免费上门退换·极速审核·店铺发货&京东售后·高价回收·支持7天无理由退货(激活后不支持)" }
        ]
      },
      {
        name: "优选服务",
        key:3,
        options: [
          { value: "只换不修", label: [{ value: '3年全保换新', price: 276 }, { value: '2年全保换新', price: 159 }] },
          { value: "坏了就修", label: [{ value: '4年全保修', price: 159 }, { value: '3年全保修', price: 129 }] },
          { value: "特色服务", label: [{ value: '2年免费换新', price: 112 }, { value: '延长3年保修', price: 39 }] },
          { value: "远程服务", label: [{ value: '服务送鼠标', price: 72 }, { value: '服务送背包', price: 75 }, { value: '上门新机开荒', price: 89 }, { value: '上门数据迁移', price: 168 }] },
        ]
      }
    ],

    // 内容-商品详情HTML（富文本）
    detailHtml: `
      <p>
    售后保障
</p>
<p>
    <strong class="blockTitle jdcn">京东承诺</strong>
</p>
<ul class=" list-paddingleft-2">
    <li>
        <p>
            京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！<br/>注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
        </p>
    </li>
</ul>
<p>
    <strong class="blockTitle zpbz">正品行货</strong>
</p>
<ul class=" list-paddingleft-2">
    <li>
        <p>
            京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
        </p>
    </li><strong class="blockTitle qlsm color-red" style="color: red;">权利声明：</strong>
    <p class="qlsm_p">
        京东上的所有商品信息、客户评价、商品咨询、网友讨论等内容，是京东重要的经营资源，未经许可，禁止非法转载使用。
    </p>
    <p class="qlsm_p">
        <strong>注：</strong>本站商品信息均来自于合作方，其真实性、准确性和合法性由信息拥有者（合作方）负责。本站不提供任何保证，并不承担任何法律责任。<br/>
    </p>
    <p class="dsj_p">
        <strong>预估到手价/到手价：</strong>是在商品标价基础上减去各种折扣、可用优惠政策叠加金额之后的一种预估的价格，计算公式示例：预估到手价=商品标价-优惠券-满减（或折扣）-新客优惠（如有）-商家会员优惠（如有），用户在进入结算页面之后，根据满足条件可享的活动（如所购商品超出商品促销价限购数量）、优惠券组合，可能导致最终到手价与显示预估到手价有差异和变化，并且不同用户可能因为可以享受的优惠不同（造成这种不同的原因包括是否属于新客或商家会员，可用优惠券差异、购买多件商品而满减活动仅支持享受1次等）而导致最终到手价不同，并且可能出现未登录和登录状态下的到手价差异。
    </p>
    <p class="dsj_p">
        <strong>京东价：</strong>京东价为商品的销售价，是您最终决定是否购买商品的依据。
    </p>
    <p class="dsj_p">
        <strong>划线价：</strong>商品展示的划横线价格为参考价，并非原价，该价格可能是品牌专柜标价、商品吊牌价或由品牌供应商提供的正品零售价（如厂商指导价、建议零售价等）或其他真实有依据的价格；由于地区、时间的差异性和市场行情波动，品牌专柜标价、商品吊牌价等可能会与您购物时展示的不一致，该价格仅供您参考。
    </p>
    <p class="dsj_p">
        <strong>折扣：</strong>如无特殊说明，折扣指销售商在原价、或划线价（如品牌专柜标价、商品吊牌价、厂商指导价、厂商建议零售价）等某一价格基础上计算出的优惠比例或优惠金额；如有疑问，您可在购买前联系销售商进行咨询。
    </p>
    <p class="dsj_p">
        <strong>异常问题：</strong>商品促销信息以商品详情页“促销”栏中的信息为准；商品的具体售价以订单结算页价格为准；如您发现活动商品售价或促销信息有异常，建议购买前先联系销售商咨询。
    </p><strong class="blockTitle nhbs color-red" style="color: red;">能效标识说明：</strong>
    <p class="nhbs_p">
        根据国家相关能效标识法规和标准的要求，京东自营在售商品的能效标识图样，将会逐步替换为新版能源效率标识贴；受能效标识标准变化影响，部分产品的新版和旧版能效标识，在能效等级、测试值等方面会有差异，但产品实际性能完全一样，并不影响购买和使用，加贴新版或旧版能效标识的商品会随机发放，请您放心购买；如有疑问，请在购买前通过咚咚或来电咨询。
    </p>
</ul>
    `,

    // 内容-规格参数表格数据，label标签
    specTable: [
      { label: "品牌", value: "海尔（Haier）" },
      { label: "商品编号", value: "10058603912071" },
      { label: "店铺", value: "海尔笔记本旗舰店" },
      { label: "显卡型号", value: "集成显卡" },
      { label: "产品尺寸", value: "长357mm 宽245mm 高19.9mm" },
      { label: "型号", value: "锐16" },
      { label: "产品净重", value: "1.6kg" },
      { label: "内存频率", value: "4800MHz" },
      { label: "处理器加速频率", value: "3.6GHz" },
      { label: "蓝牙连接", value: "支持蓝牙" }
    ],

    // 评论
    comment: [
      {
        commentator: "文***K",
        content: "可以，很好，价格在其他平台对比了下，价格是最低的，还是官方旗舰店，有保障"
      },
      {
        commentator: "t***j",
        content: "618活动便宜了100多还好吧，性能还可以，速度也够快，可以用于商务，用来上网课，看电视都不错的，还比较薄轻。"
      },
      {
        commentator: "4***f",
        content: "不错，发货速度快，包装结实保证笔记本不受外力。"
      }
    ]


  },
  // ... 更多商品
  // src/data/products.js

  {
    id: 2,
    // 基本信息
    title: "罗莱家纺 无痕安睡床笠 母婴A类防螨防水隔尿床垫席梦思罩 米1.8*2.0",
    subtitle: "",
    services: ['7天无理由退货', '假一赔十', '急速发货'],
    // 库存信息
    stock: 1000,//库存
    sales: 3500,//销量
    //加入购物车
    quantity: 1,     // 数量，加入购物车一次添加的数量
    selected: false,//购物车初始是否选中

    // 物流信息
    delivery: {
      area: "北京市",  // 发货地
      time: "1-3天",  // 预计送达
      free: true       // 是否包邮
    },

    // 促销标签
    promotions: [
      "政府补贴",
      "已预减￥259.8",
      "最高返103京豆"
    ],

    // 图片
    imgsrc: "/x2 (1).jpg",
    images: [
      "/x2 (1).jpg",
      "/x2 (2).jpg",
      "/x2 (3).jpg",
      "/x2 (4).jpg",
      "/x2 (5).jpg",
      "/x2 (6).jpg",
      "/x2 (7).jpg",
      "/x2 (8).jpg",
      "/x2 (9).jpg"
    ],

    // 规格参数，available可用的
    specifications: [
      {
        name: "系列品",
        key:1,
        options: [
          { value: "无痕安睡床笠-防水透气" },
          { value: "无痕安睡床笠SE-防滑贴合" },
          { value: "12G【免费升16G】+1TB【16英寸大屏】" }
        ]
      },
      {
        name: "颜色",
        key:1,
        options: [
          { value: "【100%阻螨+防水透气】月光灰" },
          { value: "【【100%阻螨+防水透气】云曦白" },
          { value: "【100%阻螨+防水透气】深空蓝" }
        ]
      },
      {
        name: "尺码",
        key:2,
        options: [
          { value: "200*220cm", price: 1599.2 },
          { value: "200*200cm", price: 1519.2 },
          { value: "180*200cm", price: 1039.2 },
          { value: "150*200cm", price: 959.2 },
          { value: "120*200cm", price: 799.2 },
          { value: "90*200cm", price: 719.2 }
        ]
      },
      {
        name: "服务",
        key:1,
        options: [
          { value: "59元免基础运费·可配送全球·7天价保·免费上门退换·上门换新·闪电退款·京东发货&售后服务·支持7天无理由退货(使用后不支持)" }
        ]
      },
      {
        name: "居家服务",
        key:3,
        options: [
          { value: "只换不修", label: [{ value: '2年损坏换新', price: 58 }, { value: '1年损坏换新', price: 36 }] },
          { value: "换新补贴", label: [{ value: '2年复购补贴', price: 68 }, { value: '1年复购补贴', price: 43 }] }

        ]
      }
    ],

    // 内容-商品详情HTML（富文本）
    detailHtml: `
      <p>
    售后保障
</p>
<p>
    <strong class="blockTitle jdcn">京东承诺</strong>
</p>
<ul class=" list-paddingleft-2">
    <li>
        <p>
            京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！<br/>注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
        </p>
    </li>
</ul>
<p>
    <strong class="blockTitle zpbz">正品行货</strong>
</p>
<ul class=" list-paddingleft-2">
    <li>
        <p>
            京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
        </p>
    </li><strong class="blockTitle qlsm color-red" style="color: red;">权利声明：</strong>
    <p class="qlsm_p">
        京东上的所有商品信息、客户评价、商品咨询、网友讨论等内容，是京东重要的经营资源，未经许可，禁止非法转载使用。
    </p>
    <p class="qlsm_p">
        <strong>注：</strong>本站商品信息均来自于合作方，其真实性、准确性和合法性由信息拥有者（合作方）负责。本站不提供任何保证，并不承担任何法律责任。<br/>
    </p>
    <p class="dsj_p">
        <strong>预估到手价/到手价：</strong>是在商品标价基础上减去各种折扣、可用优惠政策叠加金额之后的一种预估的价格，计算公式示例：预估到手价=商品标价-优惠券-满减（或折扣）-新客优惠（如有）-商家会员优惠（如有），用户在进入结算页面之后，根据满足条件可享的活动（如所购商品超出商品促销价限购数量）、优惠券组合，可能导致最终到手价与显示预估到手价有差异和变化，并且不同用户可能因为可以享受的优惠不同（造成这种不同的原因包括是否属于新客或商家会员，可用优惠券差异、购买多件商品而满减活动仅支持享受1次等）而导致最终到手价不同，并且可能出现未登录和登录状态下的到手价差异。
    </p>
    <p class="dsj_p">
        <strong>京东价：</strong>京东价为商品的销售价，是您最终决定是否购买商品的依据。
    </p>
    <p class="dsj_p">
        <strong>划线价：</strong>商品展示的划横线价格为参考价，并非原价，该价格可能是品牌专柜标价、商品吊牌价或由品牌供应商提供的正品零售价（如厂商指导价、建议零售价等）或其他真实有依据的价格；由于地区、时间的差异性和市场行情波动，品牌专柜标价、商品吊牌价等可能会与您购物时展示的不一致，该价格仅供您参考。
    </p>
    <p class="dsj_p">
        <strong>折扣：</strong>如无特殊说明，折扣指销售商在原价、或划线价（如品牌专柜标价、商品吊牌价、厂商指导价、厂商建议零售价）等某一价格基础上计算出的优惠比例或优惠金额；如有疑问，您可在购买前联系销售商进行咨询。
    </p>
    <p class="dsj_p">
        <strong>异常问题：</strong>商品促销信息以商品详情页“促销”栏中的信息为准；商品的具体售价以订单结算页价格为准；如您发现活动商品售价或促销信息有异常，建议购买前先联系销售商咨询。
    </p><strong class="blockTitle nhbs color-red" style="color: red;">能效标识说明：</strong>
    <p class="nhbs_p">
        根据国家相关能效标识法规和标准的要求，京东自营在售商品的能效标识图样，将会逐步替换为新版能源效率标识贴；受能效标识标准变化影响，部分产品的新版和旧版能效标识，在能效等级、测试值等方面会有差异，但产品实际性能完全一样，并不影响购买和使用，加贴新版或旧版能效标识的商品会随机发放，请您放心购买；如有疑问，请在购买前通过咚咚或来电咨询。
    </p>
</ul>
    `,

    // 内容-规格参数表格数据，label标签
    specTable: [
      { label: "品牌", value: "罗莱（LUOLAI）" },
      { label: "商品编号", value: "100258031738" },
      { label: "国补备案型号", value: "罗莱 无痕安睡床笠" },
      { label: "面料支数", value: "其他" },
      { label: "床品工艺", value: "无特殊工艺" },
      { label: "安全类别", value: "A类" },
      { label: "面料", value: "涤纶" },
      { label: "包装清单", value: "床笠*1" }
    ],

    // 评论
    comment: [
      {
        commentator: "j***6",
        content: "尺寸非常合适，料子手感非常舒服，裸睡在上面确实不错，贴合度很好，透气吸引也不错，最主要不用手去拉扯，他睡完之后起床非常的平整，个人觉得是件非常值得推崇的商品"
      },
      {
        commentator: "m***g",
        content: "收到这款床笠太惊喜了，面料摸起来很舒服，铺在床垫上完全贴合，包裹的很严实，还有一点就是透气性好，完全满意"
      },
      {
        commentator: "w***c",
        content: "罗莱床帘，在其他平台刷到的，必须来京东商城下单，才放心，母婴A类，防水透气，面料柔软舒适，可机洗，做工精细，真心不错，喜欢！好评！"
      }
    ]


  },
  //商品
  // src/data/products.js

  

  {
    id: 3,
    // 基本信息
    title: "QUAMER千丝万缕流苏编织麻花手链女2024新款爆款S925纯银复 编织麻花手绳",
    subtitle: "",
    services: ['7天无理由退货', '假一赔十', '急速发货'],
    // 库存信息
    stock: 99,//库存
    sales: 150,//销量
    //加入购物车
    quantity: 1,     // 数量，加入购物车一次添加的数量
    selected: false,//购物车初始是否选中

    // 物流信息
    delivery: {
      area: "北京市",  // 发货地
      time: "1-3天",  // 预计送达
      free: true       // 是否包邮
    },

    // 促销标签
    promotions: [
      "官方直降",
      "立减15%8",
      "最高返11京豆"
    ],

    // 图片
    imgsrc: "/x3 (1).jpg",
    images: [
      "/x3 (1).jpg",
      "/x3 (2).jpg",
      "/x3 (3).jpg",
      "/x3 (4).jpg",
      "/x3 (5).jpg",
      "/x3 (6).jpg"
    ],

    // 规格参数，available可用的
    specifications: [
      {
        name: "样式",
        key: 2,
        options: [
          { value: "编织麻花手绳", price: 119 },
          { value: "编织麻花手绳+精美礼盒", price: 136 },
          { value: "蝴蝶编织项链", price: 133.28 },
          { value: "蝴蝶编织项链+精美礼盒", price: 153 },
          { value: "和田玉花丝手镯", price: 136 },
          { value: "和田玉花丝手镯+精美礼盒", price: 153 }
        ]
      },
      {
        name: "服务",
        key: 1,
        options: [
          { value: "可配送全球·7天价保·免费上门退换·闪电退款·店铺发货&京东售后支持7天无理由退货" }
        ]
      }
    ],

    // 内容-商品详情HTML（富文本）
    detailHtml: `
      <p>
    售后保障
</p>
<p>
    <strong class="blockTitle jdcn">京东承诺</strong>
</p>
<ul class=" list-paddingleft-2">
    <li>
        <p>
            京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！<br/>注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
        </p>
    </li>
</ul>
<p>
    <strong class="blockTitle zpbz">正品行货</strong>
</p>
<ul class=" list-paddingleft-2">
    <li>
        <p>
            京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
        </p>
    </li><strong class="blockTitle qlsm color-red" style="color: red;">权利声明：</strong>
    <p class="qlsm_p">
        京东上的所有商品信息、客户评价、商品咨询、网友讨论等内容，是京东重要的经营资源，未经许可，禁止非法转载使用。
    </p>
    <p class="qlsm_p">
        <strong>注：</strong>本站商品信息均来自于合作方，其真实性、准确性和合法性由信息拥有者（合作方）负责。本站不提供任何保证，并不承担任何法律责任。<br/>
    </p>
    <p class="dsj_p">
        <strong>预估到手价/到手价：</strong>是在商品标价基础上减去各种折扣、可用优惠政策叠加金额之后的一种预估的价格，计算公式示例：预估到手价=商品标价-优惠券-满减（或折扣）-新客优惠（如有）-商家会员优惠（如有），用户在进入结算页面之后，根据满足条件可享的活动（如所购商品超出商品促销价限购数量）、优惠券组合，可能导致最终到手价与显示预估到手价有差异和变化，并且不同用户可能因为可以享受的优惠不同（造成这种不同的原因包括是否属于新客或商家会员，可用优惠券差异、购买多件商品而满减活动仅支持享受1次等）而导致最终到手价不同，并且可能出现未登录和登录状态下的到手价差异。
    </p>
    <p class="dsj_p">
        <strong>京东价：</strong>京东价为商品的销售价，是您最终决定是否购买商品的依据。
    </p>
    <p class="dsj_p">
        <strong>划线价：</strong>商品展示的划横线价格为参考价，并非原价，该价格可能是品牌专柜标价、商品吊牌价或由品牌供应商提供的正品零售价（如厂商指导价、建议零售价等）或其他真实有依据的价格；由于地区、时间的差异性和市场行情波动，品牌专柜标价、商品吊牌价等可能会与您购物时展示的不一致，该价格仅供您参考。
    </p>
    <p class="dsj_p">
        <strong>折扣：</strong>如无特殊说明，折扣指销售商在原价、或划线价（如品牌专柜标价、商品吊牌价、厂商指导价、厂商建议零售价）等某一价格基础上计算出的优惠比例或优惠金额；如有疑问，您可在购买前联系销售商进行咨询。
    </p>
    <p class="dsj_p">
        <strong>异常问题：</strong>商品促销信息以商品详情页“促销”栏中的信息为准；商品的具体售价以订单结算页价格为准；如您发现活动商品售价或促销信息有异常，建议购买前先联系销售商咨询。
    </p><strong class="blockTitle nhbs color-red" style="color: red;">能效标识说明：</strong>
    <p class="nhbs_p">
        根据国家相关能效标识法规和标准的要求，京东自营在售商品的能效标识图样，将会逐步替换为新版能源效率标识贴；受能效标识标准变化影响，部分产品的新版和旧版能效标识，在能效等级、测试值等方面会有差异，但产品实际性能完全一样，并不影响购买和使用，加贴新版或旧版能效标识的商品会随机发放，请您放心购买；如有疑问，请在购买前通过咚咚或来电咨询。
    </p>
</ul>
    `,

    // 内容-规格参数表格数据，label标签
    specTable: [
      { label: "品牌", value: "QUAMER" },
      { label: "商品编号", value: "10104252622912" },
      { label: "店铺", value: "灵芙燕珠宝首饰专营店" },
      { label: "风格", value: "简约风" },
      { label: "货号", value: "892961163299708" },
      { label: "类别", value: "手链" },
      { label: "材质", value: "其他" },
      { label: "适用人群", value: "通用" }
    ],

    // 评论
    comment: [
      {
        commentator: "老婆说买买才能最快乐",
        content: "商品收到了，包装得很好，物流非常快，客服态度很积极，有问题及时解答！总体来说非常满意！价格非常的美丽，东西还是不错的，会继续回购！全五分！奈斯奈斯～这次购物非常满意，商品性价比高，质量可靠。物流高效，商家服务周到，售后完善。"
      },
      {
        commentator: "j***E",
        content: "入手不亏的手链！闪钻很牢固，阳光下超闪，显白又提气质。材质亲肤，过敏星人也能戴，好评～"
      },
      {
        commentator: "j***k",
        content: "细节做工很到位，流苏垂坠感十足，单戴叠戴都好看，戴久了也不易氧化。"
      }
    ]


  },
  // src/data/products.js

  {
    id: 4,
    // 基本信息
    title: "蓝莲花杯子玻璃杯茶杯家用耐高温女生高颜值玻璃杯女士花茶杯小清新 繁花玻璃杯454ml",
    subtitle: "",
    services: ['7天无理由退货', '假一赔十', '急速发货'],
    // 库存信息
    stock: 1000,//库存
    sales: 3500,//销量
    //加入购物车
    quantity: 1,     // 数量，加入购物车一次添加的数量
    selected: false,//购物车初始是否选中

    // 物流信息
    delivery: {
      area: "北京市",  // 发货地
      time: "1-3天",  // 预计送达
      free: true       // 是否包邮
    },

    // 促销标签
    promotions: [
      "跨店满减"
    ],

    // 图片
    imgsrc: "/x4 (1).jpg",
    images: [
      "/x4 (1).jpg",
      "/x4 (2).jpg",
      "/x4 (3).jpg",
      "/x4 (4).jpg",
      "/x4 (5).jpg",
      "/x4 (6).jpg"
    ],

    // 规格参数，available可用的
    specifications: [
      {
        name: "款式",
        key:1,
        options: [
          { value: "繁花玻璃杯454ml", price: 31.8  },
          { value: "小粉圆玻璃杯454ml" , price: 31.8 },
          { value: "鸡蛋花玻璃杯454ml" , price: 31.8 },
          { value: "夏花玻璃杯454ml" , price: 31.8 }
        ]
      },
      
      {
        name: "服务",
        key:1,
        options: [
          { value: "晚到赔·免费上门退换·闪电退款·极速审核·180天可退可换先行理赔·破损包退换·30天价保险·店铺发货&京东售后支持7天无理由退货" }
        ]
      },
      {
        name: "居家服务",
        key:3,
        options: [
          { value: "意外换新", label: [{ value: '2年破碎换新', price: 4 }, { value: '1年破碎换新', price: 3 }] },
          { value: "换新补贴", label: [{ value: '2年复购补贴', price: 3 }, { value: '1年复购补贴', price: 2 }] }

        ]
      }
    ],

    // 内容-商品详情HTML（富文本）
    detailHtml: `
    <p>
  售后保障
</p>
<p>
  <strong class="blockTitle jdcn">京东承诺</strong>
</p>
<ul class=" list-paddingleft-2">
  <li>
      <p>
          京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！<br/>注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
      </p>
  </li>
</ul>
<p>
  <strong class="blockTitle zpbz">正品行货</strong>
</p>
<ul class=" list-paddingleft-2">
  <li>
      <p>
          京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
      </p>
  </li><strong class="blockTitle qlsm color-red" style="color: red;">权利声明：</strong>
  <p class="qlsm_p">
      京东上的所有商品信息、客户评价、商品咨询、网友讨论等内容，是京东重要的经营资源，未经许可，禁止非法转载使用。
  </p>
  <p class="qlsm_p">
      <strong>注：</strong>本站商品信息均来自于合作方，其真实性、准确性和合法性由信息拥有者（合作方）负责。本站不提供任何保证，并不承担任何法律责任。<br/>
  </p>
  <p class="dsj_p">
      <strong>预估到手价/到手价：</strong>是在商品标价基础上减去各种折扣、可用优惠政策叠加金额之后的一种预估的价格，计算公式示例：预估到手价=商品标价-优惠券-满减（或折扣）-新客优惠（如有）-商家会员优惠（如有），用户在进入结算页面之后，根据满足条件可享的活动（如所购商品超出商品促销价限购数量）、优惠券组合，可能导致最终到手价与显示预估到手价有差异和变化，并且不同用户可能因为可以享受的优惠不同（造成这种不同的原因包括是否属于新客或商家会员，可用优惠券差异、购买多件商品而满减活动仅支持享受1次等）而导致最终到手价不同，并且可能出现未登录和登录状态下的到手价差异。
  </p>
  <p class="dsj_p">
      <strong>京东价：</strong>京东价为商品的销售价，是您最终决定是否购买商品的依据。
  </p>
  <p class="dsj_p">
      <strong>划线价：</strong>商品展示的划横线价格为参考价，并非原价，该价格可能是品牌专柜标价、商品吊牌价或由品牌供应商提供的正品零售价（如厂商指导价、建议零售价等）或其他真实有依据的价格；由于地区、时间的差异性和市场行情波动，品牌专柜标价、商品吊牌价等可能会与您购物时展示的不一致，该价格仅供您参考。
  </p>
  <p class="dsj_p">
      <strong>折扣：</strong>如无特殊说明，折扣指销售商在原价、或划线价（如品牌专柜标价、商品吊牌价、厂商指导价、厂商建议零售价）等某一价格基础上计算出的优惠比例或优惠金额；如有疑问，您可在购买前联系销售商进行咨询。
  </p>
  <p class="dsj_p">
      <strong>异常问题：</strong>商品促销信息以商品详情页“促销”栏中的信息为准；商品的具体售价以订单结算页价格为准；如您发现活动商品售价或促销信息有异常，建议购买前先联系销售商咨询。
  </p><strong class="blockTitle nhbs color-red" style="color: red;">能效标识说明：</strong>
  <p class="nhbs_p">
      根据国家相关能效标识法规和标准的要求，京东自营在售商品的能效标识图样，将会逐步替换为新版能源效率标识贴；受能效标识标准变化影响，部分产品的新版和旧版能效标识，在能效等级、测试值等方面会有差异，但产品实际性能完全一样，并不影响购买和使用，加贴新版或旧版能效标识的商品会随机发放，请您放心购买；如有疑问，请在购买前通过咚咚或来电咨询。
  </p>
</ul>
  `,

    // 内容-规格参数表格数据，label标签
    specTable: [
      { label: "品牌", value: "蓝莲花" },
      { label: "商品编号", value: "10086690567265" },
      { label: "店铺", value: "蓝莲花餐具旗舰店" },
      { label: "货号", value: "繁花玻璃杯" },
      { label: "使用场景", value: "花茶杯" },
      { label: "材质", value: "高硼硅玻璃" },
      { label: "适用人群", value: "女士" },
      { label: "功能", value: "耐高温" }
    ],

    // 评论
    comment: [
      {
        commentator: "u***n",
        content: "家人们谁懂啊！收到这组印花玻璃杯一整个被美住 杯身的小花图案超清新，像把春日花园揣进杯子里~质感也很绝，通透厚实，用来喝牛奶、咖啡，连心情都跟着变甜啦,包装也很用心，到手完好无损，性价比拉满，怒囤几套用一辈子都不腻，妥妥的家居幸福感小物，买它！"
      },
      {
        commentator: "A***y",
        content: "包装完好无损，京东快递神速送达。杯子容量很大，比较轻巧，杯子壁有些薄，清洗和拿取的时候要小心且注意，避免破损。整体不错，还会继续支持和光顾！"
      },
      {
        commentator: "余***里",
        content: "杯子颜值很高，花色很好看，小清新的感觉，喝水的时候都很好看"
      }
    ]


  },
  // src/data/products.js

  {
    id: 5,
    // 基本信息
    title: "傲比（AOBI）轻奢碗碟餐具套装【细腻通透】景德镇家用粉色玉瓷陶瓷碗盘子 58头粉玉瓷-赠送高档礼盒",
    subtitle: "",
    services: ['7天无理由退货', '假一赔十', '急速发货'],
    // 库存信息
    stock: 80,//库存
    sales: 20,//销量
    //加入购物车
    quantity: 1,     // 数量，加入购物车一次添加的数量
    selected: false,//购物车初始是否选中

    // 物流信息
    delivery: {
      area: "北京市",  // 发货地
      time: "1-3天",  // 预计送达
      free: true       // 是否包邮
    },

    // 促销标签
    promotions: [
      "满588享9.5折",
      "最高返478京豆"
    ],

    // 图片
    imgsrc: "/x5 (1).jpg",
    images: [
      "/x5 (1).jpg",
      "/x5 (2).jpg",
      "/x5 (3).jpg",
      "/x5 (4).jpg",
      "/x5 (5).jpg",
      "/x5 (6).jpg",
      "/x5 (7).jpg",
      "/x5 (8).jpg"
    ],

    // 规格参数，available可用的
    specifications: [
      {
        name: "系列品",
        key:1,
        options: [
          { value: "玉瓷粉色系列" },
          { value: "玉瓷白色系列" }
        ]
      },
      
      {
        name: "款式",
        key:2,
        options: [
          { value: "32头粉玉瓷-赠送高档礼盒", price: 4783.25 },
          { value: "58头粉玉瓷-赠送高档礼盒", price: 5025.22 },
          { value: "定制【联系客服，直接拍不发】", price: 1140 }
        ]
      },
      {
        name: "服务",
        key:1,
        options: [
          { value: "可配送全球·免费上门退换·闪电退款·极速审核·破损包退换·7天价保店铺发货&京东售后·支持7天无理由退货(使用后不支持)" }
        ]
      },
      {
        name: "居家服务",
        key:3,
        options: [
          { value: "意外换新", label: [{ value: '2年破碎换新', price: 83 }, { value: '1年破碎换新', price: 62 }] },
          { value: "换新补贴", label: [{ value: '2年复购补贴', price: 113 }, { value: '1年复购补贴', price: 71 }] }

        ]
      }
    ],

    // 内容-商品详情HTML（富文本）
    detailHtml: `
    <p>
  售后保障
</p>
<p>
  <strong class="blockTitle jdcn">京东承诺</strong>
</p>
<ul class=" list-paddingleft-2">
  <li>
      <p>
          京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！<br/>注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
      </p>
  </li>
</ul>
<p>
  <strong class="blockTitle zpbz">正品行货</strong>
</p>
<ul class=" list-paddingleft-2">
  <li>
      <p>
          京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
      </p>
  </li><strong class="blockTitle qlsm color-red" style="color: red;">权利声明：</strong>
  <p class="qlsm_p">
      京东上的所有商品信息、客户评价、商品咨询、网友讨论等内容，是京东重要的经营资源，未经许可，禁止非法转载使用。
  </p>
  <p class="qlsm_p">
      <strong>注：</strong>本站商品信息均来自于合作方，其真实性、准确性和合法性由信息拥有者（合作方）负责。本站不提供任何保证，并不承担任何法律责任。<br/>
  </p>
  <p class="dsj_p">
      <strong>预估到手价/到手价：</strong>是在商品标价基础上减去各种折扣、可用优惠政策叠加金额之后的一种预估的价格，计算公式示例：预估到手价=商品标价-优惠券-满减（或折扣）-新客优惠（如有）-商家会员优惠（如有），用户在进入结算页面之后，根据满足条件可享的活动（如所购商品超出商品促销价限购数量）、优惠券组合，可能导致最终到手价与显示预估到手价有差异和变化，并且不同用户可能因为可以享受的优惠不同（造成这种不同的原因包括是否属于新客或商家会员，可用优惠券差异、购买多件商品而满减活动仅支持享受1次等）而导致最终到手价不同，并且可能出现未登录和登录状态下的到手价差异。
  </p>
  <p class="dsj_p">
      <strong>京东价：</strong>京东价为商品的销售价，是您最终决定是否购买商品的依据。
  </p>
  <p class="dsj_p">
      <strong>划线价：</strong>商品展示的划横线价格为参考价，并非原价，该价格可能是品牌专柜标价、商品吊牌价或由品牌供应商提供的正品零售价（如厂商指导价、建议零售价等）或其他真实有依据的价格；由于地区、时间的差异性和市场行情波动，品牌专柜标价、商品吊牌价等可能会与您购物时展示的不一致，该价格仅供您参考。
  </p>
  <p class="dsj_p">
      <strong>折扣：</strong>如无特殊说明，折扣指销售商在原价、或划线价（如品牌专柜标价、商品吊牌价、厂商指导价、厂商建议零售价）等某一价格基础上计算出的优惠比例或优惠金额；如有疑问，您可在购买前联系销售商进行咨询。
  </p>
  <p class="dsj_p">
      <strong>异常问题：</strong>商品促销信息以商品详情页“促销”栏中的信息为准；商品的具体售价以订单结算页价格为准；如您发现活动商品售价或促销信息有异常，建议购买前先联系销售商咨询。
  </p><strong class="blockTitle nhbs color-red" style="color: red;">能效标识说明：</strong>
  <p class="nhbs_p">
      根据国家相关能效标识法规和标准的要求，京东自营在售商品的能效标识图样，将会逐步替换为新版能源效率标识贴；受能效标识标准变化影响，部分产品的新版和旧版能效标识，在能效等级、测试值等方面会有差异，但产品实际性能完全一样，并不影响购买和使用，加贴新版或旧版能效标识的商品会随机发放，请您放心购买；如有疑问，请在购买前通过咚咚或来电咨询。
  </p>
</ul>
  `,

    // 内容-规格参数表格数据，label标签
    specTable: [
      { label: "品牌", value: "傲比（AOBI）" },
      { label: "商品编号", value: "10092092145680" },
      { label: "店铺", value: "傲比（AOBI）旗舰店" },
      { label: "货号", value: "M9370" },
      { label: "国产/进口", value: "进口" },
      { label: "风格", value: "中式" },
      { label: "材质", value: "陶瓷" },
      { label: "包装形式", value: "礼盒装" }
    ],

    // 评论
    comment: [
      {
        commentator: "2***1",
        content: "质量很好，做工精致。餐具的颜值也太高了吧，粉粉的。非常的晶莹剔透，太满意了。"
      },
      {
        commentator: "j***8",
        content: "收到，很喜欢，款式简约，质感很好，做工细致。很细腻通透值得推荐"
      },
      {
        commentator: "v***z",
        content: "这套陶瓷碗盘非常的高端轻奢。颜色也非常的好看，我简直太满意了。"
      }
    ]


  },


];

// 获取商品详情的函数
export const getProductById = (id) => {
  return products.find(product => product.id === id);
};